# Ex 5.1: Part IV (Outside Class)

In [1]:
import pandas as pd
import plotly.express as px

# 1. Read one of the data sources to combine into a Dataframe

In [3]:
df_customers = pd.read_excel("Data/w3schools_Data.xlsx", "Customers", skiprows=2)

print(df_customers.shape)
df_customers.head()

(93, 7)

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,5021,Mexico
2,3,Antonio Moreno Taquería,Antonio Moreno,Mataderos 2312,México D.F.,5023,Mexico
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK
4,5,Berglunds snabbköp,Christina Berglund,Berguvsvägen 8,Luleå,S-958 22,Sweden

# 2. Read a second data source to combine into a Dataframe

In [4]:
df_P3 = pd.read_csv("Data/P3_OD_OR_Prod_Cat.csv")

print(df_P3.shape)
df_P3.head(3)

(518, 15)

,OrderDetailID,OrderID,Product_ID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID,Product_Name,SupplierID,CategoryID,ProductDescription,ProductPrice,CategoryName,Description
0,1,10248,11,12,90,5,1996-07-04,3,Queso Cabrales,5,4,1 kg pkg.,21.0,Dairy Products,Cheeses
1,2,10248,42,10,90,5,1996-07-04,3,Singaporean Hokkien Fried Mee,20,5,32 - 1 kg pkgs.,14.0,Grains/Cereals,"Breads, crackers, pasta, and cereal"
2,3,10248,72,5,90,5,1996-07-04,3,Mozzarella di Giovanni,14,4,24 - 200 g pkgs.,34.8,Dairy Products,Cheeses

# 3. Make Crucial Decisions

### Decision 1: Choose the Left and Right Tables

In [5]:
left_table = df_P3
right_table = df_customers

### Decision 2:  Choose the Join Fields

In [6]:
left_table.head(1)

,OrderDetailID,OrderID,Product_ID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID,Product_Name,SupplierID,CategoryID,ProductDescription,ProductPrice,CategoryName,Description
0,1,10248,11,12,90,5,1996-07-04,3,Queso Cabrales,5,4,1 kg pkg.,21.0,Dairy Products,Cheeses

In [7]:
right_table.head(1)

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany

In [8]:
left_table_join_field = 'CustomerID'
right_table_join_field = 'CustomerID'

# 4. Use pandas *merge()* to create a Left Join

In [9]:
df_joined = pd.merge(left_table,       
                       right_table,     
                       left_on=left_table_join_field,
                       right_on=right_table_join_field,
                       how='left'         # Type of Join:  Left!
                      )

print()
print("Ex 5.1 Part 4: Merged Customers data")
print("Left Table:  ", left_table.shape)
print("Right Table: ", right_table.shape)
print("Joined Dataframe: ", df_joined.shape)
print()

df_joined.head(2)

Ex 5.1 Part 4: Merged Customers data
Left Table:   (518, 15)
Right Table:  (93, 7)
Joined Dataframe:  (518, 21)

,OrderDetailID,OrderID,Product_ID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID,Product_Name,SupplierID,...,ProductDescription,ProductPrice,CategoryName,Description,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,10248,11,12,90,5,1996-07-04,3,Queso Cabrales,5,...,1 kg pkg.,21.0,Dairy Products,Cheeses,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
1,2,10248,42,10,90,5,1996-07-04,3,Singaporean Hokkien Fried Mee,20,...,32 - 1 kg pkgs.,14.0,Grains/Cereals,"Breads, crackers, pasta, and cereal",Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland

# Optional:  Save the Joined Dataframe as a CSV file

In [10]:
csv_file_to_create = "P4_OD_OR_Prod_Cat_Cust.csv"

filename_with_path = "Data/" + csv_file_to_create
df_joined.to_csv(filename_with_path, index=False)